ДомПласт_локальная_база/src/Documents/ВводНачальныхОстатковОС/ВводНачальныхОстатковОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачальныхОстатковОС</name>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ОбъектыИмущественногоНалога</registerRecords>
  <registerRecords>InformationRegister.СоставОС</registerRecords>
  <registerRecords>InformationRegister.ФиксированныеАктивыУчитываемыеОтдельно</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ОбъектыТранспортногоНалога</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ОбъектыЗемельногоНалога</registerRecords>
  <registerRecords>InformationRegister.СчетаУчетаОС</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <registerRecords>InformationRegister.СостоянияОСОрганизаций</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccountingRegister.Типовой</registerRecords>
  <registerRecords>InformationRegister.ГрафикиАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаОС</registerRecords>
  <registerRecords>InformationRegister.ОбъектыНалоговогоУчетаФА</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаНУ</name>
    <type>
      <types>CatalogRef.ВидыУчетаНУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьКПН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурноеПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ВыработкаКоличествоБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикАмортизацииБУ</name>
      <type>
        <types>CatalogRef.ГодовыеГрафикиАмортизацииОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияКУчетуРегл</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомерРегл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентАмортизацииБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскоренияБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеДокументаПринятияКУчетуРегл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НакопленнаяАмортизацияБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюБУ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокументаПринятияКУчетуРегл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизацииБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>РодительскоеОС</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработкиБУ</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимостьБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПринятияКУчетуРегл</name>
      <type>
        <types>CatalogRef.СобытияОС</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособНачисленияАмортизацииБУ</name>
      <type>
        <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияРасходовПоАмортизацииБУ</name>
      <type>
        <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособПоступленияРегл</name>
      <type>
        <types>EnumRef.СпособыПоступленияАктивов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизацииБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПолезногоИспользованияБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизацииБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНачисленияАмортизацииБУ</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаБУ</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимостьБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДСПоПриобретению</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДСПоРеализации</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаЗатратПоМодернизацииБУ</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетДоходовОтРеализацииБУ</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетСебестоимостиПриРеализацииБУ</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакФиксированногоАктива</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаНУ</name>
      <type>
        <types>CatalogRef.ГруппыНалоговогоУчетаФА</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимостьНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимостьПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокПогашенияСтоимостиНУ</name>
      <type>
        <types>EnumRef.ПорядокПогашенияСтоимостиФА</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектИмущественногоНалога</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектТранспортногоНалога</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектЗемельногоНалога</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ</name>
      <type>
        <types>ChartOfAccountsRef.Типовой</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДомПласт_локальная_база/src/Documents/ВводНачальныхОстатковОС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область УправлениеДоступом

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ОбщегоНазначенияБК.ЗаполнитьНаборыПоОрганизацииСтурктурномуПодразделению(ЭтотОбъект, Таблица, "Организация", "СтруктурноеПодразделение");
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ПомощникВводаНачальныхОстатков") Тогда
			ДанныеЗаполнения.Свойство("Дата", Дата);
			ДанныеЗаполнения.Свойство("Организация", Организация);
			ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета(),,, ДанныеЗаполнения);
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Автор") Тогда
			ДанныеЗаполнения.Удалить("Автор");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	Иначе
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УчитыватьКПН Тогда
		ВидУчетаНУ = Справочники.ВидыУчетаНУ.ПустаяСсылка();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Не ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаНалогаНаПрибыль(Организация, Дата) Или Не УчитыватьКПН Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидУчетаНУ");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если ОС.Количество() > 0 Тогда
		ПроверитьЗаполнениеТабличнойЧастиПострочно(Отказ);
	КонецЕсли; 
	
	УправлениеВнеоборотнымиАктивамиСервер.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ОС", Новый Структура("ОсновноеСредство"), Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.ВводНачальныхОстатковОС.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Если вдруг не удалось получить параметры проведения и не установлен флаг Отказ, то просто выйдем из проведения
	Если ПараметрыПроведения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	Если ПараметрыПроведения.ТаблицаВыработкаОС.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияВыработкаОС(ПараметрыПроведения.ТаблицаВыработкаОС,
												Движения, Отказ);
	КонецЕсли;
	
	Если ПараметрыПроведения.ТаблицаГрафикиАмортизацииОСБух.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияИзменениеГрафиковАмортизацииОС(ПараметрыПроведения.ТаблицаГрафикиАмортизацииОСБух,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаЗемельногоНалога.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияИзменениеЗемельногоНалога(ПараметрыПроведения.ТаблицаЗемельногоНалога, ПараметрыПроведения.Реквизиты,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаИмущественногоНалога.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияОбъектыИмущественногоНалога(ПараметрыПроведения.ТаблицаИмущественногоНалога, ПараметрыПроведения.Реквизиты,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаМестонахождениеОСБух.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияМестонахождениеОСБух(ПараметрыПроведения.ТаблицаМестонахождениеОСБух,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаНачислениеАмортизацииБух.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияИзменениеПризнакаНачисленияАмортизацииОС(ПараметрыПроведения.ТаблицаНачислениеАмортизацииБух, ПараметрыПроведения.Реквизиты,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаОбъектыНалоговогоУчетаФА.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияОбъектыНалоговогоУчетаФА(ПараметрыПроведения.ТаблицаОбъектыНалоговогоУчетаФА,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаПараметрыАмортизацииБух.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияПараметрыАмортизацииОСБухгалтерскийУчет(ПараметрыПроведения.ТаблицаПараметрыАмортизацииБух,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаПервоначальныеСведенияОСБух.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияПервоначальныеСведенияОСБух(ПараметрыПроведения.ТаблицаПервоначальныеСведенияОСБух,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаПроводокБух.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияПроводокБух(ПараметрыПроведения.ТаблицаПроводокБух,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаПроводокНал.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияПроводокНал(ПараметрыПроведения.ТаблицаПроводокНал,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаСобытияОСОрганизаций.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияРегистрацияСобытияОС(ПараметрыПроведения.ТаблицаСобытияОСОрганизаций, 
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаСоставОС.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияСоставОС(ПараметрыПроведения.ТаблицаСоставОС, 
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаСостоянияОСБух.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияИзменениеСостоянияОС(ПараметрыПроведения.ТаблицаСостоянияОСБух, 
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаСпособыОтраженияБух.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияСпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет(ПараметрыПроведения.ТаблицаСпособыОтраженияБух,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаСчетовУчетаОСБух.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияСчетовУчетаОСБух(ПараметрыПроведения.ТаблицаСчетовУчетаОСБух,
												Движения, Отказ);
	КонецЕсли;
	
	Если ПараметрыПроведения.ТаблицаТранспортногоНалога.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияИзменениеТранспортногоНалога(ПараметрыПроведения.ТаблицаТранспортногоНалога, ПараметрыПроведения.Реквизиты,
												Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.ТаблицаФиксированныеАктивыУчитываемыеОтдельно.Количество() <> 0 Тогда 
		Документы.ВводНачальныхОстатковОС.СформироватьДвиженияФиксированныеАктивыУчитываемыеОтдельно(ПараметрыПроведения.ТаблицаФиксированныеАктивыУчитываемыеОтдельно,
												Движения, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());

КонецПроцедуры   

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПроверитьЗаполнениеТабличнойЧастиПострочно(Отказ)
	
	Для Каждого ТекСтрока Из ОС Цикл
		
		Если Не ТекСтрока.НачислятьАмортизациюБУ Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ТекСтрока.СрокПолезногоИспользованияБУ) Тогда
			ТекстСообщения = ОбщегоНазначенияБККлиентСервер.ПолучитьТекстСообщения("Колонка",, НСтр("ru = 'Срок полезного использования (БУ), мес.'"), ТекСтрока.НомерСтроки, "ОС");
			Поле = "ОС[" + Формат(ТекСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СрокПолезногоИспользованияБУ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ТекСтрока.СпособНачисленияАмортизацииБУ) Тогда
			ТекстСообщения = ОбщегоНазначенияБККлиентСервер.ПолучитьТекстСообщения("Колонка",, НСтр("ru = 'Способ начисления амортизации (БУ)'"), ТекСтрока.НомерСтроки, "ОС");
			Поле = "ОС[" + Формат(ТекСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СпособНачисленияАмортизацииБУ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекСтрока.СпособОтраженияРасходовПоАмортизацииБУ) Тогда
			ТекстСообщения = ОбщегоНазначенияБККлиентСервер.ПолучитьТекстСообщения("Колонка",, НСтр("ru = 'Способ отражения расходов по амортизации (БУ)'"), ТекСтрока.НомерСтроки, "ОС");
			Поле = "ОС[" + Формат(ТекСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СпособОтраженияРасходовПоАмортизацииБУ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;  		
				
	КонецЦикла; 
	
КонецПроцедуры
  
#КонецЕсли
